{
  "path": "/features/typescript",
  "blocks": [
    {
      "hero__heading": "Ship better code with confidence",
      "hero__subheading": "**Rockin' Blocks** ships with Typescript out of the box, helping you find nuances throughout your code before your drummer does. Enjoy type generation and autocompletion from your own component library. ",
      "_template": "hero-block",
      "hero__buttonText": "View the Code",
      "hero__buttonLink": "https://github.com/rockinblocks/rockinblocks"
    },
    {
      "contentBasic__content": "# Rockin' Blocks are written in Typescript \n\n## Enjoy autocompletion of your own component library.\n\nAll of the elements and blocks provided by **Rockin' Blocks** -- even the blocks you create -- will provide autocompletion within VS Code, Atom, and Sublime. Examples of typed components are provided to help new Typescript developers get started.\n\n## Easy to edit & understand\n\nThe **Rockin' Blocks** workspace brings [Gatsby](https://gatsbyjs.com) and [TinaCMS](https://tina.io) together to provide a robust CMS experience on top of a simple GraphQL interface with basic JSON and Markdown files. The end result is a development experience that is easy for both developers and marketing teams to contribute and share the burden of getting a product to market.\n\n## Enjoy the benefits of version control\n\n**Rockin' Blocks** reads changes to files on your filesystem and monitors those changes with Git. This means non-developers can make changes through the CMS and still enjoy all the benefits of version control: branching, pull requests, etc.\n\n## Transition from WordPress or Drupal\n\n**Rockin' Blocks** is a great starting point for teams that are familiar with building and maintaining sites in older CMS frameworks like WordPress and Drupal. If you're familiar in developing with plugins like [Advanced Custom Fields](), you'll have no problem getting started with **Rockin' Blocks**.\n\n## Ship with Confidence\n\nEvery customizable block comes with testing examples powered by Jest and Enzyme. This means that, finally, there is a page builder available that provides tests  Because **Rockin' Blocks** is powered by Git, it's a breeze to hook up CI/CD integrations with GitHub, GitLab, or BitBucket.",
      "contentBasic__flexDirection": "row",
      "_template": "content-basic-block"
    }
  ]
}